# N을 받아서, 1부터 N까지 숫자가 한번씩만 사용되고 중복되는 숫자를 문자열 s에서 찾아보자

# s = '1232512817681762837618123513514236283761928479'
# N = 5
# 결과 '51423'

# pattern = r'^(?=.*1)(?=.*2)(?=.*3)(?=.*4)(?=.*5)(?=.*6)(?=.*7)(?=.*8)(?=.*9)[1-{}]+'.format(N)
import re
N = 5
s = '1232512817681762837618123513514236283761928479'
_N = list(map(str, range(1, N+1)))
pattern = ['(?='] + [f'(.*{i})' for i in range(1, N+1)] + [')'] + [f'[1-{N}]{{{N}}}']
pattern = ''.join(pattern)
answer = re.findall(pattern, s)
print(pattern, "\n\n", answer)